const inputField = document.querySelector('.water__temperature__input');
const result = document.querySelector('.water__result');
const btnResult = document.querySelector('.result__btn');

btnResult.addEventListener('click', () => {

    if (Number(inputField.value) >= 0 && Number(inputField.value) <= 100) {
        result.innerHTML = `РІДКИЙ <p class="water__state">Рідкий стан води в природі зустрічається нам найчастіше. У цій формі Н2О може перебувати в діапазоні температур від 0 до 100 градусів за Цельсієм. Саме це агрегатний стан має вода в річках, морях, океанах і під час дощу.
Ця прозора субстанція не має ні смаку, ні запаху, ні власної форми. Рідина здається самої податливою, але в той же час вона має колосальну силу. Рідкий стан води в природі дає їй можливість розчиняти багато речовин. Потоки води можуть зруйнувати гірські породи,
 створити печери, і таким чином поміняти рельєф планети.</p>`;
    } else if (Number(inputField.value) < 0) {
        result.innerHTML = `ЛІД <p class="water__state">Н2О з рідкого переходить в твердий агрегатний стан 
        при зниженні температури нижче 0 градусів за Цельсієм. Цікаво те, що майже всі предмети при охолодженні
        зменшуються в обсягах, а вода, навпаки, замерзаючи, розширюється. Якщо так вона прозора і безбарвна, то при
        замерзанні може набувати білий колір через попадання частинок повітря всередину льоду.</p>`;
    } else if (Number(inputField.value) > 100) {
        result.innerHTML = `ГАЗОПОДІБНИЙ <p class="water__state">Нагріваючи рідину до 100, 
        ми можемо побачити перехід в газоподібний стан води. У природі нам може зустрічатися така вода у вигляді хмар, туману, випарів над річками, озерами і морями при зміні погоди або просто підвищеної вологості.
        В атмосфері завжди знаходяться крапельки води, крихітний розмір яких дозволяє їм утримуватися на вазі. Ми можемо помітити присутність вологи в повітрі тільки тоді, коли її кількість збільшується, і з'являються хмари або туман.</p>`;
    } else {
        result.innerHTML = `Введіть правильні числові данні!`
        console.log(inputField.value)
    }
})

